In [7]:
# 판다스 불러오기

# import 라이브러리 as 줄임말

import pandas as pd

In [3]:
# 데이터 불러오기

# pd.read_excel('파일경로+파일명.xlsx')
# pd.read_csv('파일경로+파일명.csv')

# 파일경로는 상대경로와 절대경로가 있음

# 절대경로 : "c:/폴더1/폴더2/파일명.확장자"
# 상대경로 : "./폴더3/파일명.확장자" 처럼 현재위치가 기준

#엑셀파일에서 부러온 데이터프레임 자료를 raw에 지정
fpath = './data/exam.xlsx'
raw = pd.read_excel(fpath)

In [10]:
# head() 상단데이터 5개 살펴보기
# tail() 하단데이터 5개 살펴보기

raw.head(2)

   번호  국어  영어  수학
0  1번  70  80  75
1  2번  68  95  55

In [11]:
raw.tail(1)

   번호  국어   영어  수학
2  3번  90  100  95

In [12]:
#info 인덱스와 칼럼의 데이터 갯수 종류 알수있음
raw.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   번호      3 non-null      object
 1   국어      3 non-null      int64
 2   영어      3 non-null      int64
 3   수학      3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [13]:
# 수치형 데이터의 기초통계량
raw.describe()

              국어          영어    수학
count   3.000000    3.000000   3.0
mean   76.000000   91.666667  75.0
std    12.165525   10.408330  20.0
min    68.000000   80.000000  55.0
25%    69.000000   87.500000  65.0
50%    70.000000   95.000000  75.0
75%    80.000000   97.500000  85.0
max    90.000000  100.000000  95.0

In [ ]:
 데이터 불러들이고 head(), info(), describe()로 데이터 확인하기

In [14]:
raw

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [16]:
#Q 번호 컬럼에 있는 1번,2번들을 인덱스로 지정하고 싶다?

raw.set_index('번호')

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [17]:
raw  
# pandas는 원본데이터 잘 안건들임, 원본 수정하고 싶으면 
# 재 정의 필요

   번호  국어   영어  수학
0  1번  70   80  75
1  2번  68   95  55
2  3번  90  100  95

In [8]:
# Q 엑셀 파일 읽어올때 미리 인덱스 지정할 수 있을까?

fpath = './data/exam.xlsx'
raw = pd.read_excel(fpath, index_col = '번호')
raw

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [ ]:
# 데이터 선택하기

# 개별데이터 선택하기
# df.iloc[로우,컬럼] : 인덱스번호로 선택
# df.loc[로우,컬럼] : 이름으로 선택하기

In [10]:
raw

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [25]:
# 1행 2열 데이터 선택(55), (파이썬은 0 1 2 열 이렇게 시작)
raw.iloc[1,2]

55

In [26]:
raw.loc['1번','수학']

75

In [28]:
# 1번 국어점수는?

print(raw.loc['1번', '국어'])
print(raw.iloc[0,0])

70
70

In [ ]:
# 복수의 셀 선택하기

# df.loc[인덱스명, 컬럼명]
# df.iloc[인덱스번호, 컬럼번호]

# 인덱스/칼럼정보에 [조건1, 조건2, ...] 리스트 형태로 여러개 입력
# or 시작:종료 형태로 범위 지정 가능

In [9]:
#1번 학생의 국어/영어 점수 조회하기,  
#컬럼명 지정 시 , 리스트 형태로 국어 ,영어 컬럼을 지정
#'1번', '국어', '영어'

raw.loc['1번', ['국어','영어']]

국어    70
영어    80
Name: 1번, dtype: int64

In [12]:
#1번,2번 학생의 수학 전수 조회하기
#'1번','2번', '수학'

raw.loc[['1번','2번'], '수학']

번호
1번    75
2번    55
Name: 수학, dtype: int64

In [15]:
# 리스트와 슬라이싱 기호':'를 이용해 특정 범위를 지정하기
# 1번 학생 '영어'부터 끝까지 점수 조회하기
#'1번', '영어'컬럼부터 끝까지

raw.loc['1번','영어':]

영어    80
수학    75
Name: 1번, dtype: int64

In [ ]:
# 3.2 컬럼 선택하기

# 하나의 컬럼을 전체 선택하는  data.loc[:,컬럼명]은 줄여서 사용 가능 함
# data.컬럼명
# data['컬럼명']

In [16]:
# loc[인덱스, 컬럼]을 이용해 모든 학생들의 수학 점수를 선택하기
# 수학 컬럼 모두 선택 하기

raw.loc[:, '수학']

번호
1번    75
2번    55
3번    95
Name: 수학, dtype: int64

In [17]:
# 데이터 프레임[컬럼명] 으로 하나의 컬럼을 지정할 수있음
# 수학 컬럼  모두 선택하기

raw['수학']

번호
1번    75
2번    55
3번    95
Name: 수학, dtype: int64

In [ ]:
# 여러개의 컬럼을 선택할 경우는 원히는 컬럼을 순서대로 리스트로 만들어서 지정하면 됨
# data[['컬럼명','컬럼켱2',....]]

In [18]:
# 수학과 영어 컬럼 선택하기
# '수학', '영어'

raw[['수학','영어']]

    수학   영어
번호
1번  75   80
2번  55   95
3번  95  100

In [19]:
# 컬럼 순서를 내가 원하는 대로 변경 가능
#'수학', '영어', '국어'

raw[['수학','영어','국어']]

    수학   영어  국어
번호
1번  75   80  70
2번  55   95  68
3번  95  100  90

In [ ]:
# 3.3 특정조건 데이터 선택하기
# df[condition] --> True 인 데이터만 출력됨
# condition : True/False 로 이루어진 리스트/시리즈

In [20]:
raw

    국어   영어  수학
번호
1번  70   80  75
2번  68   95  55
3번  90  100  95

In [27]:
# 특정조건 만족 여부 판단하는 비교 연산자(>,<,==)를 사용 가능
# 수학 칼럼이 80보다 작은 경우는? (결과는 True/False 로 시리즈로 나옴)

cond = raw['수학'] < 80
cond

번호
1번     True
2번     True
3번    False
Name: 수학, dtype: bool

In [29]:
# True/False 로 된 시리즈나 리스트를 이용해 True에 해당하는 행만 선택가능
# 수학칼럼이 80보다 작다는 조건에 True가 나왔던 1번, 2번에 해당하는 데이터만 조회가능

raw[cond]

    국어  영어  수학
번호
1번  70  80  75
2번  68  95  55

In [31]:
# 비교연산자를 이용하지 않고 , 직접 True/False 값을 가진 리스트를 만들어 조건 이용도 가능
# 주의: 데이터프레임의 행개수와, 리스트의 원소개수가 동일 해야함

cond = [True,False,True]  # 1,3행만 가져오란뜻
raw[cond]

    국어   영어  수학
번호
1번  70   80  75
3번  90  100  95

In [ ]:
# 여러개의 조건 만들기 
# 조건 모두 만족(&), 하나라도 만족(|)

# & (shift + 7) ==> "and", 모두 만족하면 True
# ex) True & True = True,  True & False = False, False & False = False

# | (shift+/) ==> 'or', 하나만 만족 하면 True
# ex)True | True = True,  True | False = True, False | False = False

In [35]:
# 영어나 수학 둘 중 하나라도 80넘는 경우?
cond3 = (raw['영어']>80)
cond4 = (raw['수학']>80)

cond = cond3|cond4
raw[cond]

    국어   영어  수학
번호
2번  68   95  55
3번  90  100  95

In [37]:
# 영어 수학 둘다 80넘는 경우는?
cond3 = (raw['영어']>80)
cond4 = (raw['수학']>80)

cond = cond3 & cond4
raw[cond]

    국어   영어  수학
번호
3번  90  100  95

In [43]:
# 영어 점수가 70이상, 수학 점수가 70이상 90미만인 데이터 찾기

cond = (raw['영어']>=70) & (raw['수학']>=70) & (raw['수학']<90)
cond
raw[cond]

    국어  영어  수학
번호
1번  70  80  75

In [45]:
# 코드가 길어질 때 (\)역슬러쉬를 이용해 줄바꿈하기

cond =(raw['영어']>70)\
   & (raw['수학']>=70)\
   & (raw['수학']<90)
raw[cond]

    국어  영어  수학
번호
1번  70  80  75